let result = 'number' + 3 + 3  /* результат: ‘number33’, тип string. 
Крок 1: відбувається неявне перетворення типу number в тип string для значення 3. 
Крок 2: конкатенація  двох строкових значень ‘number’ і ’3’ (результат ‘number3’, тип string)  
Крок 3: відбувається неявне перетворення типу number в тип string для значення 3. 
Крок 4: конкатенація  двох строкових значень ‘number3’ і ’3’ (результат ‘number33’, тип string)  
*/
console.log(result);

result = null + 3 /* результат: 3, тип number. 
Крок 1: відбувається неявне перетворення null в тип number зі значенням, яке дорівнює 0. 
Крок 2: арифметична операція додавання двох операндів зі значенням 0 (тип number ) і значенням 3 (тип number)
*/
console.log(result);

result = 5 && "qwerty"/* результат: “qwerty”, тип string. 
Обидва операнди істинні, тому при виконанні логічного «І» (перетин) повертається значення останнього операнда
*/
console.log(result);

result = +'40' + +'2' + "hillel" /* результат: “42hillel”, тип string. 
Крок 1: конвертація операнду ‘40’  в тип number (+'40': унарний плюс перед стрінговим значенням 40). 
Крок 2: конвертація операнду ‘2’  в тип number (+'2': це унарний плюс перед стрінговим значенням 2). Крок 3: арифметична операція додавання двох операндів зі значенням 40 (тип number ) і значенням 2 (тип number) (результат 42, тип number) 
Крок 4. відбувається неявне перетворення типа number в тип string для значення 42 (результат ‘42’, тип string) 
Крок 5: конкатенація  двох строкових значень ‘42’ і ’hillel’
*/
console.log(result);

result = '10' - 5 === 6 /* результат: false, тип Boolean. 
Крок 1: відбувається неявне перетворення типу string в тип number для значення '10'. 
Крок 2: арифметична операція віднімання двох операндів зі значенням 10 (тип number ) і значенням 5 (тип number) (результат 5, тип number)
Крок 3: порівняння екземплярів (instances) 5 і 6 (результат false)
*/
console.log(result);

result = true + false /* результат: 1, тип number. 
Крок 1: відбувається неявне перетворення true в тип number зі значенням, яке дорівнює 1. 
Крок 2: відбувається неявне перетворення false в тип number зі значенням, яке дорівнює 0. 
Крок 3: арифметична операція додавання двох операндів зі значенням 1(тип number ) і значенням 0 (тип number)
*/
console.log(result);

result =  '4px' - 3  /* результат: NaN, тип number. 
Спроба неявного перетворення типу string в тип number для значення '4рх' не дасть бажаного результату, тому операція віднімання двох операндів зі значенням ‘4px’ (тип string ) і значенням 3 (тип number) призведе до результату NaN (Not a number)
*/
console.log(result);

result =  '4' - 3  /* результат: 1, тип number. 
Крок 1: відбувається неявне перетворення типу string в тип number для значення '4'.
Крок 2: арифметична операція віднімання двох операндів зі значенням 4 (тип number ) і значенням 3 (тип number)
*/
console.log(result);

result = '6' + 3 ** 0  /* результат: ‘61’, тип string. 
Крок 1: арифметична операція  зведення у ступінь 0 значення 3 з типом number (результат дорівнює 1).  
Крок 2: відбувається неявне перетворення типу number в тип string для значення 1 (результат зведення у ступінь) . 
Крок 3: конкатенація  двох строкових значень ‘6’ і ’1’
*/
console.log(result);

result = 12 / '6'  /* результат: 2, тип number. 
Крок 1: відбувається неявне перетворення типу string в тип number для значення '6'. 
Крок 2: арифметична операція ділення двох операндів зі значенням 12 (тип number ) і значенням 6 (тип number)
*/
console.log(result);

result = '10' + (5 === 6) /* результат: ‘10false’, тип string. 
Крок 1: порівняння екземплярів (instances) 5 і 6 (результат false) 
Крок 2: відбувається неявне перетворення false в тип string (результат ‘false’, тип  string)
Крок 3: конкатенація  двох строкових значень’10’ і ‘false’
*/
console.log(result);

result = null == '' /* результат: false, тип Boolean. 
Порівняння контенту: значення null в даному випадку залишиться null і має тип object (історичний старий баг java script), порівняння (контенту) з порожньою строкою ( типу string) повертає false
*/
console.log(result);

result = 3 ** (9 / 3) /* результат: 27, тип number. 
Крок 1: арифметична операція ділення в дужках двох операндів зі значенням 9 (тип number ) і значенням 3 (тип number) (результат дорівнює 3) 
Крок 2: арифметична операція  зведення у ступінь 3 (попередній результат ділення)  значення 3 з типом number (результат дорівнює 27).
*/
console.log(result);

result = !!'false' == !!'true'  /* результат: true, тип Boolean. 
Крок 1: ліворуч подвійна інверсія непорожньої строки (результат true). 
Крок 2: праворуч подвійна інверсія непорожньої строки (результат true).
Крок 3: порівняння контенту, двох булевих значень (true==true, результат true)
*/
console.log(result);

result = 0 ||'0' && 1 /* результат: 1, тип number. 
Крок 1:  виконується логічне «І» (перетин) значення ‘0' типу string (непорожня строка, що відповідає 1) і значення 1 типу number (результат 1) 
Крок 2: виконується логічне «або» (об’єднання) значення 0 і значення 1 з кроку 1 (результат 1)
*/
console.log(result);

result = (+null == false) < 1 /* результат: false, тип Boolean. 
Крок 1: відбувається неявне перетворення null в тип number зі значенням 0. 
Крок 2: відбувається неявне перетворення false в тип number зі значенням 0. 
Крок 3: порівняння контенту (0 == 0, результат true)  
Крок 4: відбувається неявне перетворення true в тип number зі значенням 1.
Крок 5: відбувається строге порівняння 1<1 (результат false)
*/
console.log(result);

result = false && true || true  /* результат: true, тип Boolean. 
Крок 1: виконується логічне «І» (перетин) (результат false)  
Крок 2: виконується логічне «або» (об’єднання) (результат true)
*/
console.log(result);

result = false && (false || true) /* результат: false, тип Boolean. 
Крок 1: в дужках виконується логічне «або» (об’єднання) (результат true) 
Крок 2: виконується логічне «І» (перетин) (результат false)
*/
console.log(result);

result = (+null == false) < 1 ** 5 /* результат: false, тип Boolean. 
Крок 1: відбувається неявне перетворення null в тип number зі значенням 0. 
Крок 2: відбувається неявне перетворення false в тип number зі значенням 0. 
Крок 3: порівняння контенту (0 == 0, результат true)  
Крок 4: арифметична операція приведення 1 в ступень 5 (результат 1, тип number) 
Крок 5: відбувається неявне перетворення true в тип number зі значенням 1
Крок 6: строге порівняння 1<1 (результат false)
*/
console.log(result);